## Plan output

```
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.microservice.module.worker.data.aws_caller_identity.identity: Reading...
module.microservice.module.database.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Reading...
module.microservice.module.secrets.data.aws_partition.current: Reading...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c4c542a315b431d2]
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Reading...
module.microservice.module.worker.data.aws_region.current: Reading...
module.microservice.module.worker.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.microservice.module.service.module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.service.module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.worker.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Reading...
module.microservice.module.worker.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.worker.data.aws_partition.current: Read complete after 0s [id=aws]
module.hosted_zones.aws_route53_zone.this["document_transfer"]: Refreshing state... [id=Z02064831UC6N7D03DSNG]
module.microservice.module.secrets.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:cluster/illinois-getchildcare-staging-document-transfer]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.backend.data.aws_partition.current: Reading...
module.microservice.module.database.data.aws_region.current: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.microservice.module.service.aws_acm_certificate.endpoint["this"]: Refreshing state... [id=arn:aws:acm:us-east-1:891377151751:certificate/8ac88d33-64f4-45c5-bc82-610cf16b1a70]
module.microservice.module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.backend.data.aws_partition.current: Read complete after 0s [id=aws]
module.microservice.module.database.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.microservice.module.service.data.aws_caller_identity.identity: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.microservice.module.database.data.aws_partition.current: Reading...
module.microservice.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.backend.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=891377151751]
module.microservice.module.secrets.data.aws_region.current: Reading...
module.backend.aws_s3_bucket.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.microservice.module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.service.module.otel_config.aws_ssm_parameter.this[0]: Refreshing state... [id=/illinois-getchildcare/staging/document-transfer/otel]
module.logging.aws_s3_bucket.logs: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.logging.data.aws_caller_identity.identity: Reading...
module.microservice.module.service.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.database.module.database.data.aws_partition.current: Reading...
module.microservice.module.database.module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_region.current: Reading...
module.backend.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Reading...
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Reading...
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=891377151751]
module.microservice.module.database.module.database.data.aws_iam_policy_document.monitoring_rds_assume_role[0]: Read complete after 0s [id=76086537]
module.microservice.module.service.data.aws_region.current: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.microservice.module.service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_availability_zones.available: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=891377151751]
module.microservice.module.service.data.aws_partition.current: Reading...
module.microservice.module.service.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002]
module.microservice.module.database.aws_kms_key.database: Refreshing state... [id=c44eda7e-7b5d-43b1-977e-f4d7e580e0db]
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.microservice.module.service.module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=475677258]
module.microservice.module.secrets.aws_kms_key.secrets: Refreshing state... [id=2a8b7a60-70dc-4812-b0c2-ea121056ef55]
module.microservice.module.database.module.database.aws_iam_role.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20240719181814988100000001]
module.microservice.module.service.aws_kms_key.fargate: Refreshing state... [id=d654dd34-e8d2-4218-ab18-512c5c6bcee4]
module.microservice.module.service.data.aws_route53_zone.domain["this"]: Read complete after 0s [id=Z02064831UC6N7D03DSNG]
module.microservice.module.service.module.ecs.aws_ecs_cluster_capacity_providers.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.database.aws_kms_alias.database: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/database]
module.microservice.module.secrets.aws_kms_alias.secrets: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer/secrets]
module.microservice.module.service.aws_kms_alias.fargate: Refreshing state... [id=alias/illinois-getchildcare/staging/document-transfer]
module.microservice.module.service.aws_route53_record.endpoint_validation["staging.document-transfer.cfa.codes"]: Refreshing state... [id=Z02064831UC6N7D03DSNG__1614a409f9459d5606d9aec8c0d3cee6.staging.document-transfer.cfa.codes._CNAME]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8]
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h]
module.microservice.module.service.module.secrets_manager["onedrive"].aws_secretsmanager_secret.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D]
module.backend.aws_kms_key.backend: Refreshing state... [id=e12d42f7-5c01-4df2-8f70-8647f8e51d7e]
module.backend.aws_s3_bucket_logging.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_versioning.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_policy.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_s3_bucket_public_access_block.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.logging.aws_s3_bucket_policy.logs: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.aws_s3_bucket_server_side_encryption_configuration.logs: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.aws_s3_bucket_public_access_block.good_example: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.logging.aws_kms_key.logs: Refreshing state... [id=c9834240-1993-4623-9c60-ab21bd6a7269]
module.logging.aws_s3_bucket_versioning.logs: Refreshing state... [id=illinois-getchildcare-staging-logs]
module.microservice.module.database.module.database.aws_iam_role_policy_attachment.rds_enhanced_monitoring[0]: Refreshing state... [id=terraform-20240719181814988100000001-20240719181815513000000003]
module.backend.aws_s3_bucket_server_side_encryption_configuration.tfstate: Refreshing state... [id=illinois-getchildcare-staging-tfstate]
module.backend.aws_dynamodb_table.tfstate_lock: Refreshing state... [id=staging.tfstate]
module.backend.aws_kms_alias.backend: Refreshing state... [id=alias/illinois-getchildcare/staging/backend]
module.microservice.module.secrets.module.secrets_manager["onedrive"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8|terraform-20240826174250995600000003]
module.microservice.module.secrets.module.secrets_manager["consumer/aws"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/consumer/aws-20240807163341433400000001-r80x0h|terraform-20240807163341709200000003]
module.microservice.module.service.aws_acm_certificate_validation.endpoint["this"]: Refreshing state... [id=2024-05-20 16:37:42.638 +0000 UTC]
module.logging.aws_kms_alias.logs: Refreshing state... [id=alias/illinois-getchildcare/staging/logs]
module.microservice.module.service.module.ecr["this"].aws_ecr_repository_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.ecr["this"].aws_ecr_lifecycle_policy.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.secrets_manager["onedrive"].aws_secretsmanager_secret_version.ignore_changes[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D|terraform-20240624154936746800000001]
module.microservice.module.service.aws_iam_policy.execution: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-execution]
module.microservice.module.service.aws_cloudwatch_log_group.service: Refreshing state... [id=/aws/ecs/illinois-getchildcare/staging/document-transfer]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-02414c145b73a1bf2]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0506da06c23d3d9fe]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09c173bedb5ad4f50]
module.vpc.aws_vpc_peering_connection.peer["aptible"]: Refreshing state... [id=pcx-0abf9e62533f46ca6]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0d07fbe3b003de612]
module.vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0c4c542a315b431d2]
module.microservice.data.aws_subnets.public: Reading...
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-08ef5814b92528122]
module.microservice.data.aws_subnets.private: Reading...
module.vpc.module.endpoints.aws_security_group.this[0]: Refreshing state... [id=sg-069644483204bfc34]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02d9a8f3d11eef94a]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0189f0a7ed9c8b1c0]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07da01fd14c162f79]
module.microservice.data.aws_subnets.public: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0ebea172f63ea7b36]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-06a12308bde60f4c3]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03214fcd109cf3286]
module.microservice.data.aws_subnets.private: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0f986d198dd3b9e9d]
module.microservice.module.service.data.aws_vpc.current: Reading...
module.microservice.module.worker.data.aws_vpc.current: Reading...
module.vpc.module.endpoints.aws_security_group_rule.this["ingress_https"]: Refreshing state... [id=sgrule-4172651141]
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Reading...
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Reading...
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Reading...
module.microservice.module.database.module.database.aws_security_group.this[0]: Refreshing state... [id=sg-0ab438c6ebcfe626e]
module.microservice.module.service.module.alb["this"].aws_lb_target_group.this["endpoint"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:targetgroup/il-gcc-staging-doc-trans-app/fad70920cdce164a]
module.microservice.data.aws_subnet.private["subnet-0189f0a7ed9c8b1c0"]: Read complete after 0s [id=subnet-0189f0a7ed9c8b1c0]
module.microservice.module.service.module.task_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a66151b2382a2108]
module.microservice.data.aws_subnet.private["subnet-02d9a8f3d11eef94a"]: Read complete after 0s [id=subnet-02d9a8f3d11eef94a]
module.microservice.module.service.module.endpoint_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06ecd1480c288ef2b]
module.microservice.data.aws_subnet.private["subnet-07da01fd14c162f79"]: Read complete after 0s [id=subnet-07da01fd14c162f79]
module.microservice.module.service.module.alb["this"].aws_security_group.this[0]: Refreshing state... [id=sg-0771f8e6767f397d5]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-05cc1353d14664da7]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2201565842]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-089e988da8648dca5]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0671e05dfe5d637b6]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-04a5bc60ca5294ada]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-08ef5814b925281221080289494]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02709b47cad88a398]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01b22b1c9cb36ddbf]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07ff470ee8fb30a9c]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0744247f7fe9939f3]
module.vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::891377151751:policy/vpc-flow-log-to-cloudwatch-20240605160034315600000001]
module.microservice.module.service.data.aws_vpc.current: Read complete after 0s [id=vpc-0c4c542a315b431d2]
module.microservice.module.database.module.database.aws_db_subnet_group.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1770175940]
module.vpc.aws_route.peer["aptible-rtb-0d07fbe3b003de612"]: Refreshing state... [id=r-rtb-0d07fbe3b003de612368033544]
module.microservice.module.worker.data.aws_vpc.current: Read complete after 0s [id=vpc-0c4c542a315b431d2]
module.microservice.module.database.module.database.aws_security_group_rule.this["ingress"]: Refreshing state... [id=sgrule-931016090]
module.microservice.module.service.module.alb["this"].aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:loadbalancer/app/il-gcc-staging-doc-trans/2cb48b79633f6298]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1670266217]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0]: Refreshing state... [id=sgrule-1972381386]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.microservice.module.service.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0]: Refreshing state... [id=sgrule-1269108624]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.microservice.module.service.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1]: Refreshing state... [id=sgrule-40105728]
module.vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20240605160034316400000002-20240605160034869200000003]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/73646a3eca8caaac]
module.microservice.module.service.module.alb["this"].aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:891377151751:listener/app/il-gcc-staging-doc-trans/2cb48b79633f6298/470d149962ca870a]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.microservice.module.service.aws_route53_record.endpoint["this"]: Refreshing state... [id=Z02064831UC6N7D03DSNG_staging.document-transfer.cfa.codes_A]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0c71017a2af6cf86a]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssm"]: Refreshing state... [id=vpce-0013a4b0521c3e0eb]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ssmmessages"]: Refreshing state... [id=vpce-038d55d2906b26bf0]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2messages"]: Refreshing state... [id=vpce-01cd78c1ead4518ae]
module.vpc.module.endpoints.aws_vpc_endpoint.this["ec2"]: Refreshing state... [id=vpce-09dd677477a50e117]
module.vpc.module.endpoints.aws_vpc_endpoint.this["s3"]: Refreshing state... [id=vpce-06fe221fedf7a8bf2]
module.microservice.module.database.module.database.aws_rds_cluster.this[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0d07fbe3b003de6121080289494]
module.microservice.module.database.module.database.aws_secretsmanager_secret_rotation.this[0]: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-25551131-8b26-4ab3-af6c-216812369c2b-3RXwjx]
module.microservice.module.database.module.database.aws_rds_cluster_instance.this["two"]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-two]
module.microservice.module.database.module.database.aws_rds_cluster_instance.this["one"]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-one]
module.microservice.module.service.aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-secrets-access-20240624154936964800000002]
module.microservice.module.service.aws_iam_role.execution: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-execution]
module.microservice.module.service.aws_iam_role.task: Refreshing state... [id=illinois-getchildcare-staging-document-transfer-task]
module.microservice.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0]: Refreshing state... [id=illinois-getchildcare-staging-document-transfer]
module.microservice.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-document-transfer/illinois-getchildcare-staging-document-transfer]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.microservice.module.service.aws_iam_policy.secrets will be updated in-place
  ~ resource "aws_iam_policy" "secrets" {
        id               = "arn:aws:iam::891377151751:policy/illinois-getchildcare-staging-document-transfer-secrets-access-20240624154936964800000002"
        name             = "illinois-getchildcare-staging-document-transfer-secrets-access-20240624154936964800000002"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:ssm:us-east-1:891377151751:parameter/illinois-getchildcare/staging/document-transfer/otel",
                          - "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D",
                          + "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8",
                            "arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-25551131-8b26-4ab3-af6c-216812369c2b-3RXwjx",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "service" = "document-transfer"
        }
        # (7 unchanged attributes hidden)
    }

  # module.microservice.module.worker.aws_cloudwatch_log_group.service will be created
  + resource "aws_cloudwatch_log_group" "service" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:us-east-1:891377151751:key/c9834240-1993-4623-9c60-ab21bd6a7269"
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/illinois-getchildcare/staging/doc-transfer-worker"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "service" = "document-transfer"
        }
      + tags_all          = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
    }

  # module.microservice.module.worker.aws_iam_policy.execution will be created
  + resource "aws_iam_policy" "execution" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "doc-transfer-worker task execution policy for illinois-getchildcare staging."
      + id               = (known after apply)
      + name             = "illinois-getchildcare-staging-doc-transfer-worker-execution"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECRAuthToken"
                    },
                  + {
                      + Action   = [
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:us-east-1:891377151751:repository/illinois-getchildcare-staging-document-transfer"
                      + Sid      = "ECRRepositoryAccess"
                    },
                  + {
                      + Action    = [
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/environment" = "staging"
                              + "aws:RequestTag/project"     = "illinois-getchildcare"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "LogWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "service" = "document-transfer"
        }
      + tags_all         = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
    }

  # module.microservice.module.worker.aws_iam_policy.secrets will be created
  + resource "aws_iam_policy" "secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow acceess to doc-transfer-worker secrets for illinois-getchildcare staging."
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "illinois-getchildcare-staging-doc-transfer-worker-secrets-access-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "service" = "document-transfer"
        }
      + tags_all         = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
    }

  # module.microservice.module.worker.aws_iam_role.execution will be created
  + resource "aws_iam_role" "execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "doc-transfer-worker task execution role for illinois-getchildcare staging."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "illinois-getchildcare-staging-doc-transfer-worker-execution"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "service" = "document-transfer"
        }
      + tags_all              = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.microservice.module.worker.aws_iam_role.task will be created
  + resource "aws_iam_role" "task" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "doc-transfer-worker task role for illinois-getchildcare staging."
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "illinois-getchildcare-staging-doc-transfer-worker-task"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "service" = "document-transfer"
        }
      + tags_all              = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.microservice.module.worker.aws_kms_alias.fargate will be created
  + resource "aws_kms_alias" "fargate" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/illinois-getchildcare/staging/doc-transfer-worker"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.microservice.module.worker.aws_kms_key.fargate will be created
  + resource "aws_kms_key" "fargate" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "doc-transfer-worker hosting encryption key for illinois-getchildcare staging"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Id        = "Fargate hosting key policy"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::891377151751:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Decrypt",
                          + "kms:Encrypt",
                          + "kms:GenerateDataKey",
                          + "kms:ReEncrypt*",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "kms:CallerAccount"                 = "891377151751"
                              + "kms:EncryptionContext:aws:ecr:arn" = "arn:aws:ecr:us-east-1:891377151751:repository/illinois-getchildcare-staging-doc-transfer-worker"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow ECR to encrypt container images"
                    },
                  + {
                      + Action    = [
                          + "kms:GenerateDataKey*",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Fargate containers to encrypt objects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "service" = "document-transfer"
        }
      + tags_all                           = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
    }

  # module.microservice.module.service.module.secrets_manager["onedrive"].aws_secretsmanager_secret.this[0] will be destroyed
  # (because module.microservice.module.service.module.secrets_manager["onedrive"] is not in configuration)
  - resource "aws_secretsmanager_secret" "this" {
      - arn                            = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D" -> null
      - description                    = "Credentials for the OneDrive." -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D" -> null
      - kms_key_id                     = "alias/illinois-getchildcare/staging/document-transfer" -> null
      - name                           = "illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001" -> null
      - name_prefix                    = "illinois-getchildcare/staging/document-transfer/onedrive-" -> null
      - recovery_window_in_days        = 7 -> null
      - tags                           = {
          - "service" = "document-transfer"
        } -> null
      - tags_all                       = {
          - "environment" = "staging"
          - "project"     = "illinois-getchildcare"
          - "service"     = "document-transfer"
          - "tofu"        = "true"
        } -> null
    }

  # module.microservice.module.service.module.secrets_manager["onedrive"].aws_secretsmanager_secret_version.ignore_changes[0] will be destroyed
  # (because module.microservice.module.service.module.secrets_manager["onedrive"] is not in configuration)
  - resource "aws_secretsmanager_secret_version" "ignore_changes" {
      - arn            = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D" -> null
      - id             = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D|terraform-20240624154936746800000001" -> null
      - secret_id      = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20240624154936746800000001" -> null
      - version_stages = [] -> null
    }

  # module.microservice.module.worker.module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "illinois-getchildcare-staging-doc-transfer-worker"
      + tags     = {
          + "service" = "document-transfer"
        }
      + tags_all = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.microservice.module.worker.module.ecs.aws_ecs_cluster_capacity_providers.main[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "illinois-getchildcare-staging-doc-transfer-worker"
      + id                 = (known after apply)
    }

  # module.microservice.module.worker.module.endpoint_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "illinois-getchildcare-staging-doc-transfer-worker-endpoint-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "illinois-getchildcare-staging-doc-transfer-worker-endpoint"
          + "service" = "document-transfer"
        }
      + tags_all               = {
          + "Name"        = "illinois-getchildcare-staging-doc-transfer-worker-endpoint"
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + vpc_id                 = "vpc-0c4c542a315b431d2"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "10.0.20.0/22",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[0] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.0.20.0/22",
        ]
      + description              = "HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.microservice.module.worker.module.endpoint_security_group.aws_security_group_rule.ingress_rules[1] will be created
  + resource "aws_security_group_rule" "ingress_rules" {
      + cidr_blocks              = [
          + "10.0.20.0/22",
        ]
      + description              = "HTTPS"
      + from_port                = 443
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = []
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.microservice.module.worker.module.otel_config.aws_ssm_parameter.this[0] will be created
  + resource "aws_ssm_parameter" "this" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Configuration for the OpenTelemetry collector."
      + id             = (known after apply)
      + insecure_value = <<-EOT
            extensions:
              health_check:
            
            receivers:
              otlp:
                protocols:
                  grpc:
                    endpoint: 0.0.0.0:4317
                  http:
                    endpoint: 0.0.0.0:4318
              awsxray:
                endpoint: 0.0.0.0:2000
                transport: udp
              statsd:
                endpoint: 0.0.0.0:8125
                aggregation_interval: 60s
              awsecscontainermetrics:
            
            processors:
              batch/traces:
                timeout: 1s
                send_batch_size: 50
              batch/metrics:
                timeout: 60s
              filter:
                metrics:
                  include:
                    match_type: strict
                    metric_names:
                      - ecs.task.memory.reserved
                      - ecs.task.memory.utilized
                      - ecs.task.cpu.reserved
                      - ecs.task.cpu.utilized
                      - ecs.task.network.rate.rx
                      - ecs.task.network.rate.tx
                      - ecs.task.storage.read_bytes
                      - ecs.task.storage.write_bytes
                      - container.duration
              metricstransform:
                transforms:
                  - include: ecs.task.memory.utilized
                    action: update
                    new_name: MemoryUtilized
                  - include: ecs.task.memory.reserved
                    action: update
                    new_name: MemoryReserved
                  - include: ecs.task.cpu.utilized
                    action: update
                    new_name: CpuUtilized
                  - include: ecs.task.cpu.reserved
                    action: update
                    new_name: CpuReserved
                  - include: ecs.task.network.rate.rx
                    action: update
                    new_name: NetworkRxBytes
                  - include: ecs.task.network.rate.tx
                    action: update
                    new_name: NetworkTxBytes
                  - include: ecs.task.storage.read_bytes
                    action: update
                    new_name: StorageReadBytes
                  - include: ecs.task.storage.write_bytes
                    action: update
                    new_name: StorageWriteBytes
            
              resource:
                attributes:
                  - key: ClusterName
                    from_attribute: aws.ecs.cluster.name
                    action: insert
                  - key: aws.ecs.cluster.name
                    action: delete
                  - key: ServiceName
                    from_attribute: aws.ecs.service.name
                    action: insert
                  - key: aws.ecs.service.name
                    action: delete
                  - key: TaskId
                    from_attribute: aws.ecs.task.id
                    action: insert
                  - key: aws.ecs.task.id
                    action: delete
                  - key: TaskDefinitionFamily
                    from_attribute: aws.ecs.task.family
                    action: insert
                  - key: aws.ecs.task.family
                    action: delete
                  - key: TaskARN
                    from_attribute: aws.ecs.task.arn
                    action: insert
                  - key: aws.ecs.task.arn
                    action: delete
                  - key: DockerName
                    from_attribute: aws.ecs.docker.name
                    action: insert
                  - key: aws.ecs.docker.name
                    action: delete
                  - key: TaskDefinitionRevision
                    from_attribute: aws.ecs.task.version
                    action: insert
                  - key: aws.ecs.task.version
                    action: delete
                  - key: PullStartedAt
                    from_attribute: aws.ecs.task.pull_started_at
                    action: insert
                  - key: aws.ecs.task.pull_started_at
                    action: delete
                  - key: PullStoppedAt
                    from_attribute: aws.ecs.task.pull_stopped_at
                    action: insert
                  - key: aws.ecs.task.pull_stopped_at
                    action: delete
                  - key: AvailabilityZone
                    from_attribute: cloud.zone
                    action: insert
                  - key: cloud.zone
                    action: delete
                  - key: LaunchType
                    from_attribute: aws.ecs.task.launch_type
                    action: insert
                  - key: aws.ecs.task.launch_type
                    action: delete
                  - key: Region
                    from_attribute: cloud.region
                    action: insert
                  - key: cloud.region
                    action: delete
                  - key: AccountId
                    from_attribute: cloud.account.id
                    action: insert
                  - key: cloud.account.id
                    action: delete
                  - key: DockerId
                    from_attribute: container.id
                    action: insert
                  - key: container.id
                    action: delete
                  - key: ContainerName
                    from_attribute: container.name
                    action: insert
                  - key: container.name
                    action: delete
                  - key: Image
                    from_attribute: container.image.name
                    action: insert
                  - key: container.image.name
                    action: delete
                  - key: ImageId
                    from_attribute: aws.ecs.container.image.id
                    action: insert
                  - key: aws.ecs.container.image.id
                    action: delete
                  - key: ExitCode
                    from_attribute: aws.ecs.container.exit_code
                    action: insert
                  - key: aws.ecs.container.exit_code
                    action: delete
                  - key: CreatedAt
                    from_attribute: aws.ecs.container.created_at
                    action: insert
                  - key: aws.ecs.container.created_at
                    action: delete
                  - key: StartedAt
                    from_attribute: aws.ecs.container.started_at
                    action: insert
                  - key: aws.ecs.container.started_at
                    action: delete
                  - key: FinishedAt
                    from_attribute: aws.ecs.container.finished_at
                    action: insert
                  - key: aws.ecs.container.finished_at
                    action: delete
                  - key: ImageTag
                    from_attribute: container.image.tag
                    action: insert
                  - key: container.image.tag
                    action: delete
            
            exporters:
              awsxray:
              awsemf/application:
                namespace: "illinois-getchildcare/doc-transfer-worker"
                log_group_name: '/aws/ecs/application/metrics'
              awsemf/performance:
                namespace: ECS/ContainerInsights
                log_group_name: '/aws/ecs/containerinsights/{ClusterName}/performance'
                log_stream_name: '{TaskId}'
                resource_to_telemetry_conversion:
                  enabled: true
                dimension_rollup_option: NoDimensionRollup
                metric_declarations:
                  - dimensions: [ [ ClusterName ], [ ClusterName, TaskDefinitionFamily ] ]
                    metric_name_selectors:
                      - MemoryUtilized
                      - MemoryReserved
                      - CpuUtilized
                      - CpuReserved
                      - NetworkRxBytes
                      - NetworkTxBytes
                      - StorageReadBytes
                      - StorageWriteBytes
                  - metric_name_selectors: [container.*]
            
            service:
              pipelines:
                traces:
                  receivers: [otlp,awsxray]
                  processors: [batch/traces]
                  exporters: [awsxray]
                metrics/application:
                  receivers: [otlp, statsd]
                  processors: [batch/metrics]
                  exporters: [awsemf/application]
                metrics/performance:
                  receivers: [awsecscontainermetrics ]
                  processors: [filter, metricstransform, resource]
                  exporters: [ awsemf/performance ]
            
              extensions: [health_check]
        EOT
      + key_id         = (known after apply)
      + name           = "/illinois-getchildcare/staging/doc-transfer-worker/otel"
      + tags           = {
          + "service" = "document-transfer"
        }
      + tags_all       = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + tier           = "Intelligent-Tiering"
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.microservice.module.worker.module.task_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "illinois-getchildcare-staging-doc-transfer-worker-endpoint-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "illinois-getchildcare-staging-doc-transfer-worker-endpoint"
          + "service" = "document-transfer"
        }
      + tags_all               = {
          + "Name"        = "illinois-getchildcare-staging-doc-transfer-worker-endpoint"
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + vpc_id                 = "vpc-0c4c542a315b431d2"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.microservice.module.worker.module.task_security_group.aws_security_group_rule.egress_rules[0] will be created
  + resource "aws_security_group_rule" "egress_rules" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All protocols"
      + from_port                = -1
      + id                       = (known after apply)
      + ipv6_cidr_blocks         = [
          + "::/0",
        ]
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = -1
      + type                     = "egress"
    }

  # module.microservice.module.worker.module.task_security_group.aws_security_group_rule.ingress_with_source_security_group_id[0] will be created
  + resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      + description              = "doc-transfer-worker access from the load balancer."
      + from_port                = 80
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.microservice.module.service.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:891377151751:service/illinois-getchildcare-staging-document-transfer/illinois-getchildcare-staging-document-transfer"
        name                               = "illinois-getchildcare-staging-document-transfer"
        tags                               = {
            "service" = "document-transfer"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-document-transfer:55" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.microservice.module.worker.module.ecs_service.module.fargate.aws_ecs_service.main[0] will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "illinois-getchildcare-staging-doc-transfer-worker"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "service" = "document-transfer"
        }
      + tags_all                           = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_controller {
          + type = "ECS"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0189f0a7ed9c8b1c0",
              + "subnet-02d9a8f3d11eef94a",
              + "subnet-07da01fd14c162f79",
            ]
        }
    }

  # module.microservice.module.service.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-document-transfer:55" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:891377151751:task-definition/illinois-getchildcare-staging-document-transfer" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name              = "illinois-getchildcare-staging-document-transfer"
                  ~ portMappings      = [
                      ~ {
                          - appProtocol   = ""
                          - hostPort      = 3000
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  ~ secrets           = [
                        # (1 unchanged element hidden)
                        {
                            name      = "DATABASE_USER"
                            valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:rds!cluster-25551131-8b26-4ab3-af6c-216812369c2b-3RXwjx:username::"
                        },
                      ~ {
                            name      = "ONEDRIVE_CLIENT_ID"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D:client_id::" -> "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8:client_id::"
                        },
                      ~ {
                            name      = "ONEDRIVE_CLIENT_SECRET"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D:client_secret::" -> "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8:client_secret::"
                        },
                      ~ {
                            name      = "ONEDRIVE_DRIVE_ID"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D:drive_id::" -> "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8:drive_id::"
                        },
                      ~ {
                            name      = "ONEDRIVE_TENANT_ID"
                          ~ valueFrom = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240624154614915200000001-nOtR8D:tenant_id::" -> "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8:tenant_id::"
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
                {
                    command          = [
                        "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                    cpu              = 256
                    environment      = [
                        {
                            name  = "OTEL_LOG_LEVEL"
                            value = "info"
                        },
                    ]
                    essential        = false
                    image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/aws/ecs/illinois-getchildcare/staging/document-transfer"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "otel-collector"
                        }
                    }
                    memory           = 512
                    name             = "otel-collector"
                    secrets          = [
                        {
                            name      = "AOT_CONFIG_CONTENT"
                            valueFrom = "arn:aws:ssm:us-east-1:891377151751:parameter/illinois-getchildcare/staging/document-transfer/otel"
                        },
                    ]
                },
            ] # forces replacement
        )
      ~ id                       = "illinois-getchildcare-staging-document-transfer" -> (known after apply)
      ~ revision                 = 55 -> (known after apply)
        tags                     = {
            "service" = "document-transfer"
        }
        # (10 unchanged attributes hidden)
    }

  # module.microservice.module.worker.module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "illinois-getchildcare-staging-doc-transfer-worker"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "service" = "document-transfer"
        }
      + tags_all                 = {
          + "environment" = "staging"
          + "project"     = "illinois-getchildcare"
          + "service"     = "document-transfer"
          + "tofu"        = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

Plan: 20 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  + onedrive_secret               = "arn:aws:secretsmanager:us-east-1:891377151751:secret:illinois-getchildcare/staging/document-transfer/onedrive-20240826174250702300000001-0UEen8"
  + repository_arn                = "arn:aws:ecr:us-east-1:891377151751:repository/illinois-getchildcare-staging-document-transfer"
  + repository_url                = "891377151751.dkr.ecr.us-east-1.amazonaws.com/illinois-getchildcare-staging-document-transfer"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```